import os

from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = str(os.getenv('BOT_TOKEN'))

admins = [
    389250313,
    5126427004
]

workers = [
    508330370, # Саня
    749172153, # Настя
    5126427004, # Рома
    747264449, # Нико
    5264637470 # Леша
]

banned_messages = [
    'бан',
    'спам',
    'боты',
    'привет',
    'сука',
    'бля',
    "архипиздрит",
    "басран",
    "бздение",
    "бздеть",
    "бздех",
    "бзднуть",
    "бздун",
    "бздунья",
    "бздюха",
    "бикса",
    "блежник",
    "блудилище",
    "бляд",
    "блябу",
    "блябуду",
    "блядун",
    "блядунья",
    "блядь",
    "блядюга",
    "взьебка",
    "волосянка",
    "взьебывать",
    "взебывать",
    "выблядок",
    "выблядыш",
    "выебать",
    "выеть",
    "выпердеть", "высраться", "выссаться", "говенка", "говенный", "говешка", "говназия", "говнецо", "говно", "говноед", "говночист", "говнюк", "говнюха", "говнядина", "говняк", "говняный", "говнять", "гондон", "дермо", "долбоеб", "дрисня", "дрист", "дристать", "дристануть", "дристун", "дристуха", "дрочена", "дрочила", "дрочилка", "дрочить", "дрочка", "ебало", "ебальник", "ебануть", "ебаный", "ебарь", "ебатория", "ебать", "ебаться", "ебец", "ебливый", "ебля", "ебнуть", "ебнуться", "ебня", "ебун", "елда", "елдак", "елдачить", "заговнять", "задристать", "задрока", "заеба", "заебанец", "заебать", "заебаться", "заебываться", "заеть", "залупа", "залупаться", "залупить", "залупиться", "замудохаться", "засерун", "засеря", "засерать", "засирать", "засранец", "засрун", "захуячить", "злоебучий", "изговнять", "изговняться", "кляпыжиться", "курва", "курвенок", "курвин", "курвяжник", "курвяжница", "курвяжный", "манда", "мандавошка", "мандей", "мандеть", "мандища", "мандюк", "минет", "минетчик", "минетчица", "мокрохвостка", "мокрощелка", "мудак", "муде", "мудеть", "мудила", "мудистый", "мудня", "мудоеб", "мудозвон", "муйня", "набздеть", "наговнять", "надристать", "надрочить", "наебать", "наебнуться", "наебывать", "нассать", "нахезать", "нахуйник", "насцать", "обдристаться", "обдристаться", "обосранец", "обосрать", "обосцать", "обосцаться", "обсирать", "опизде", "отпиздячить", "отпороть", "отъеть", "охуевательский", "охуевать", "охуевающий", "охуеть", "охуительный", "охуячивать", "охуячить", "педрик", "пердеж", "пердение", "пердеть", "пердильник", "перднуть", "пердун", "пердунец", "пердунина", "пердунья", "пердуха", "пердь", "передок", "пернуть", "пидор", "пизда", "пиздануть", "пизденка", "пиздеть", "пиздить", "пиздища", "пиздобратия", "пиздоватый", "пиздорванец", "пиздорванка", "пиздострадатель", "пиздун", "пиздюга", "пиздюк", "пиздячить", "писять", "питишка", "плеха", "подговнять", "подъебнуться", "поебать", "поеть", "попысать", "посрать", "поставить", "поцоватый", "презерватив", "проблядь", "проебать", "промандеть", "промудеть", "пропиздеть", "пропиздячить", "пысать", "разъеба", "разъебай", "распиздай", "распиздеться", "распиздяй", "распроеть", "растыка", "сговнять", "секель", "серун", "серька", "сика", "сикать", "сикель", "сирать", "сирывать", "скурвиться", "скуреха", "скурея", "скуряга", "скуряжничать", "спиздить", "срака", "сраный", "сранье", "срать", "срун", "ссака", "ссаки", "ссать", "старпер", "струк", "суходрочка", "сцавинье", "сцака", "сцаки", "сцание", "сцать", "сциха", "сцуль", "сцыха", "сыкун", "титечка", "титечный", "титка", "титочка", "титька", "трипер", "триппер", "усраться", "усцаться", "фуй", "хезать", "хер", "херня", "херовина", "херовый", "хитрожопый", "хлюха", "хуевина", "хуевый", "хуек", "хуепромышленник", "хуерик", "хуесос", "хуище", "хуй", "хуйня", "хуйрик", "хуякать", "хуякнуть", "целка", "шлюха",
    "ебать",
    "блядь",
    "хуй",
    "хер",
    "елда",
    "муде",
    "пизда",
    "манда",
    "дрочить",
    "залупа",
    "пидарас",
    "гандон",
    "малафья"
]
words_of_gratitude = [
    'thx', 'спс', 'спасибо', 'Спасибо', 'Благодарю', 'благодарка', 'от души', 'thank you'
]

chat_ids = [-1001724860087]

mute_by_bad_word_time = 1
mute_by_ads_time = 4

time_of_violations = 30


IP = os.getenv('IP')
PGUSER = str(os.getenv('PGUSER'))
PGPASSWORD = str(os.getenv('PGPASSWORD'))
DATABASE = str(os.getenv('DATABASE'))

POSTGRES_URL = f"postgresql://{PGUSER}:{PGPASSWORD}@{IP}/{DATABASE}"

